src/main/resources/examples/inXML.txt

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header />
   <S:Body>
      <ns0:WFMGetAppointments xmlns:ns0="http://www.openuri.org/" xmlns:ns1="http://rci.rogers.com/schemas/CallCentre" xmlns:ns10="http://rci.rogers.com/schemas/Scope" xmlns:ns2="http://rci.rogers.com/schemas/Contact" xmlns:ns3="http://rci.rogers.com/schemas/Context" xmlns:ns5="http://rci.rogers.com/schemas/WFMCommon" xmlns:ns6="http://rci.rogers.com/schemas/WFMConfirmAppointment" xmlns:ns7="http://rci.rogers.com/schemas/WFMGetAppointments" xmlns:ns8="http://rci.rogers.com/schemas/WFMReleaseAppointment" xmlns:ns9="http://rci.rogers.com/schemas/WFMReserveAppointment">
         <ns7:WFMGetAppointmentsRequest ns10:scope="Cable" TransactionId="Thu Nov 15 16:06:05 EST 2018_1542315965976">
            <ns7:Context>
               <ns3:Channel>WS</ns3:Channel>
               <ns3:ClientSystem>TPIAPORTAL</ns3:ClientSystem>
               <ns3:InvocationMethod>WFMGetAppointments</ns3:InvocationMethod>
               <ns3:InvocationState>U</ns3:InvocationState>
            </ns7:Context>
            <ns7:WFMGetAppointmentInfo>
               <ns7:CallID>C231408875800</ns7:CallID>
               <ns7:OrderType>RECN</ns7:OrderType>
               <ns7:NumberOfRequiredEngineers>1</ns7:NumberOfRequiredEngineers>
               <ns7:CBU>SWO</ns7:CBU>
               <ns7:Region>SWO-SERV-INST</ns7:Region>
               <ns7:District>CAMBRIDGE</ns7:District>
               <ns7:MapArea>630</ns7:MapArea>
               <ns7:SourcePriority>06</ns7:SourcePriority>
               <ns7:WorkType>TOPP</ns7:WorkType>
               <ns7:Duration>2340</ns7:Duration>
               <ns7:City>CAMBRIDGE</ns7:City>
               <ns7:State>Ontario</ns7:State>
               <ns7:PostalCode>N1R5G5</ns7:PostalCode>
               <ns7:SourceLatitude>43.350552</ns7:SourceLatitude>
               <ns7:SourceLongitude>-80.294198</ns7:SourceLongitude>
               <ns7:StartDate>2018-11-22</ns7:StartDate>
               <ns7:RequiredSkills>
                  <ns7:TaskRequiredSkill>
                     <ns7:Key>TPIA</ns7:Key>
                  </ns7:TaskRequiredSkill>
               </ns7:RequiredSkills>
            </ns7:WFMGetAppointmentInfo>
         </ns7:WFMGetAppointmentsRequest>
      </ns0:WFMGetAppointments>
   </S:Body>
</S:Envelope>
